/*
 Navicat Premium Data Transfer

 Source Server         : mysql_connect
 Source Server Type    : MySQL
 Source Server Version : 80035
 Source Host           : localhost:3306
 Source Schema         : test

 Target Server Type    : MySQL
 Target Server Version : 80035
 File Encoding         : 65001

 Date: 16/01/2024 22:21:02
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for commentforbook
-- ----------------------------
DROP TABLE IF EXISTS `commentforbook`;
CREATE TABLE `commentforbook`  (
  `id` int(0) NOT NULL AUTO_INCREMENT,
  `book_version` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `user_comment` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `user_grade` int(0) NULL DEFAULT NULL,
  `user_nickname` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `user_email` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `book_id` int(0) NULL DEFAULT NULL,
  `create_time` datetime(0) NULL DEFAULT NULL,
  `update_time` datetime(0) NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `book_id`(`book_id`) USING BTREE,
  INDEX `user_nickname`(`user_nickname`) USING BTREE,
  INDEX `user_email`(`user_email`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 152 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of commentforbook
-- ----------------------------
INSERT INTO `commentforbook` VALUES (9, '978-7-6666-4848-2', '非常精彩的一本书，作者的笔触细腻，情节引人入胜。', 8, '汐渐', 'hyg3146624068@163.com', 3, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (10, '978-7-5598-4846-9', '一个令人深思的故事，充满了想象力和创新。', 4, '马英九', '2323223@qq.com', 28, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (11, '978-7-5555-4848-8', '这本书让我重新审视历史，内容丰富，深度好评。', 6, '汐渐', 'hyg3146624068@163.com', 1, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (12, '978-7-5555-4848-8', '一个令人深思的故事，充满了想象力和创新。', 7, '汐渐', 'hyg3146624068@163.com', 1, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (13, '978-7-5555-4848-8', '非常精彩的一本书，作者的笔触细腻，情节引人入胜。', 3, '马英华', '2031282938@qq.com', 1, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (14, '978-7-5555-4848-8', '一个令人深思的故事，充满了想象力和创新。', 3, '小丑', '851314610@qq.com', 1, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (15, '978-7-5555-4848-8', '作者的写作风格独特，故事情节紧凑，强烈推荐。', 8, '小丑', '851314610@qq.com', 1, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (16, '978-7-6666-4848-1', '作者的写作风格独特，故事情节紧凑，强烈推荐。', 1, '汐渐', 'hyg3146624068@163.com', 2, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (17, '978-7-6666-4848-1', '这本书让我重新审视历史，内容丰富，深度好评。', 7, '小丑', '851314610@qq.com', 2, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (18, '978-7-6666-4848-1', '一个令人深思的故事，充满了想象力和创新。', 7, '马英华', '2031282938@qq.com', 2, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (19, '978-7-6666-4848-1', '一个令人深思的故事，充满了想象力和创新。', 9, 'jocker', 'myhsnd666@gmail.com', 2, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (20, '978-7-6666-4848-2', '这本书展现了作者深厚的文学功底，故事引人入胜。', 1, 'yhempr', 'yhempr@gmail.com', 3, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (21, '978-7-6666-4848-2', '虽然情节吸引人，但某些部分显得过于拖沓。', 2, '马英九', '2323223@qq.com', 3, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (22, '978-7-6666-4848-2', '这是一部必读之作，每个人都应该读一读。', 3, '马英华', '2031282938@qq.com', 3, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (23, '978-7-6666-4848-2', '个别章节缺乏深度，但总体来说还算不错。', 4, 'jocker', 'myhsnd666@gmail.com', 3, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (24, '978-7-6666-4848-3', '作者的想象力令人赞叹，创造了一个精彩的世界。', 5, '小丑', '851314610@qq.com', 4, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (25, '978-7-6666-4848-3', '故事情节平淡无奇，缺乏新意。', 6, '汐渐', 'hyg3146624068@163.com', 4, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (26, '978-7-6666-4848-3', '精彩绝伦，让人难以放下。', 7, 'yhempr', 'yhempr@gmail.com', 4, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (27, '978-7-6666-4848-3', '写作风格不符合我的口味，感觉有些乏味。', 8, '马英九', '2323223@qq.com', 4, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (28, '978-7-6666-4848-4', '充满智慧和洞察，非常推荐。', 9, '马英华', '2031282938@qq.com', 5, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (29, '978-7-6666-4848-4', '期待更多有深度的内容，这本书只触及了表面。', 10, 'jocker', 'myhsnd666@gmail.com', 5, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (30, '978-7-6666-4848-4', '一个激动人心的故事，充满了惊喜。', 1, '小丑', '851314610@qq.com', 5, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (31, '978-7-6666-4848-4', '结构松散，缺乏清晰的主线。', 2, '汐渐', 'hyg3146624068@163.com', 5, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (32, '978-7-6666-4848-5', '绝对值得一读，非常喜欢这本书。', 3, 'yhempr', 'yhempr@gmail.com', 6, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (33, '978-7-6666-4848-5', '主题有些重复，需要更多创新。', 4, '马英九', '2323223@qq.com', 6, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (34, '978-7-6666-4848-5', '故事引人入胜，难以抗拒。', 5, '马英华', '2031282938@qq.com', 6, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (35, '978-7-6666-4848-5', '感觉作者在某些部分有点敷衍了事。', 6, 'jocker', 'myhsnd666@gmail.com', 6, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (36, '978-7-6666-4848-6', '这本书真是太棒了，每个细节都处理得很好。', 7, '小丑', '851314610@qq.com', 7, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (37, '978-7-6666-4848-6', '有些部分我觉得可以更加深入一些。', 8, '汐渐', 'hyg3146624068@163.com', 7, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (38, '978-7-6666-4848-6', '不错的书籍，但有几处地方我觉得有些瑕疵。', 9, 'yhempr', 'yhempr@gmail.com', 7, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (39, '978-7-6666-4848-6', '整体来看，这是一本值得一读的书。', 10, '马英九', '2323223@qq.com', 7, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (40, '978-7-6666-4848-2', '这本书展现了作者深厚的文学功底，故事引人入胜。', 1, 'yhempr', 'yhempr@gmail.com', 3, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (41, '978-7-6666-4848-2', '虽然情节吸引人，但某些部分显得过于拖沓。', 2, '马英九', '2323223@qq.com', 3, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (42, '978-7-6666-4848-2', '这是一部必读之作，每个人都应该读一读。', 3, '马英华', '2031282938@qq.com', 3, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (43, '978-7-6666-4848-2', '个别章节缺乏深度，但总体来说还算不错。', 4, 'jocker', 'myhsnd666@gmail.com', 3, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (44, '978-7-6666-4848-3', '作者的想象力令人赞叹，创造了一个精彩的世界。', 5, '小丑', '851314610@qq.com', 4, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (45, '978-7-6666-4848-3', '故事情节平淡无奇，缺乏新意。', 6, '汐渐', 'hyg3146624068@163.com', 4, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (46, '978-7-6666-4848-3', '精彩绝伦，让人难以放下。', 7, 'yhempr', 'yhempr@gmail.com', 4, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (47, '978-7-6666-4848-3', '写作风格不符合我的口味，感觉有些乏味。', 8, '马英九', '2323223@qq.com', 4, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (48, '978-7-6666-4848-4', '充满智慧和洞察，非常推荐。', 9, '马英华', '2031282938@qq.com', 5, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (49, '978-7-6666-4848-4', '期待更多有深度的内容，这本书只触及了表面。', 10, 'jocker', 'myhsnd666@gmail.com', 5, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (50, '978-7-6666-4848-4', '一个激动人心的故事，充满了惊喜。', 1, '小丑', '851314610@qq.com', 5, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (51, '978-7-6666-4848-4', '结构松散，缺乏清晰的主线。', 2, '汐渐', 'hyg3146624068@163.com', 5, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (52, '978-7-6666-4848-5', '绝对值得一读，非常喜欢这本书。', 3, 'yhempr', 'yhempr@gmail.com', 6, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (53, '978-7-6666-4848-5', '主题有些重复，需要更多创新。', 4, '马英九', '2323223@qq.com', 6, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (54, '978-7-6666-4848-5', '故事引人入胜，难以抗拒。', 5, '马英华', '2031282938@qq.com', 6, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (55, '978-7-6666-4848-5', '感觉作者在某些部分有点敷衍了事。', 6, 'jocker', 'myhsnd666@gmail.com', 6, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (56, '978-7-6666-4848-6', '这本书展现了作者深厚的文学功底，故事引人入胜。', 7, '小丑', '851314610@qq.com', 7, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (57, '978-7-6666-4848-6', '虽然情节吸引人，但某些部分显得过于拖沓。', 8, '汐渐', 'hyg3146624068@163.com', 7, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (58, '978-7-6666-4848-6', '这是一部必读之作，每个人都应该读一读。', 9, 'yhempr', 'yhempr@gmail.com', 7, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (59, '978-7-6666-4848-6', '个别章节缺乏深度，但总体来说还算不错。', 10, '马英九', '2323223@qq.com', 7, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (60, '978-7-6666-4848-7', '作者的想象力令人赞叹，创造了一个精彩的世界。', 1, '马英华', '2031282938@qq.com', 8, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (61, '978-7-6666-4848-7', '故事情节平淡无奇，缺乏新意。', 2, 'jocker', 'myhsnd666@gmail.com', 8, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (62, '978-7-6666-4848-7', '精彩绝伦，让人难以放下。', 3, '小丑', '851314610@qq.com', 8, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (63, '978-7-6666-4848-7', '写作风格不符合我的口味，感觉有些乏味。', 4, '汐渐', 'hyg3146624068@163.com', 8, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (64, '978-7-6666-4848-8', '充满智慧和洞察，非常推荐。', 5, 'yhempr', 'yhempr@gmail.com', 9, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (65, '978-7-6666-4848-8', '期待更多有深度的内容，这本书只触及了表面。', 6, '马英九', '2323223@qq.com', 9, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (66, '978-7-6666-4848-8', '一个激动人心的故事，充满了惊喜。', 7, '马英华', '2031282938@qq.com', 9, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (67, '978-7-6666-4848-8', '结构松散，缺乏清晰的主线。', 8, 'jocker', 'myhsnd666@gmail.com', 9, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (68, '978-7-6666-4848-8', '绝对值得一读，非常喜欢这本书。', 9, '小丑', '851314610@qq.com', 10, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (69, '978-7-6666-4848-8', '主题有些重复，需要更多创新。', 10, '汐渐', 'hyg3146624068@163.com', 10, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (70, '978-7-6666-4848-8', '故事引人入胜，难以抗拒。', 1, 'yhempr', 'yhempr@gmail.com', 10, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (71, '978-7-6666-4848-8', '感觉作者在某些部分有点敷衍了事。', 2, '马英九', '2323223@qq.com', 10, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (72, '978-7-5217-4157-5', '这本书的深度和广度都令人印象深刻。', 9, 'yhempr', 'yhempr@gmail.com', 11, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (73, '978-7-5217-4157-5', '尽管主题引人入胜，但某些章节感觉冗长。', 7, '马英九', '2323223@qq.com', 11, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (74, '978-7-5217-4157-5', '作者对细节的处理堪称一绝，非常推荐。', 9, '马英华', '2031282938@qq.com', 11, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (75, '978-7-5217-4157-5', '有些部分稍显平淡，但总体上是本好书。', 7, 'jocker', 'myhsnd666@gmail.com', 11, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (76, '978-7-5598-4846-1', '故事情节紧凑且充满悬念，十分吸引人。', 8, '小丑', '851314610@qq.com', 12, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (77, '978-7-5598-4846-1', '个别情节的转折略显突兀，但整体质量上乘。', 7, '汐渐', 'hyg3146624068@163.com', 12, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (78, '978-7-5598-4846-1', '这本书的叙事风格独特\r\n\r\n，充满了新颖的想法。', 9, 'yhempr', 'yhempr@gmail.com', 12, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (79, '978-7-5598-4846-1', '虽然书中有创新的元素，但有时感觉力不从心。', 6, '马英九', '2323223@qq.com', 12, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (80, '978-7-5598-4846-2', '书中充满了丰富的情感和深刻的思考。', 9, '马英华', '2031282938@qq.com', 13, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (81, '978-7-5598-4846-2', '有些章节稍微有些乏味，但整体还是值得一读。', 8, 'jocker', 'myhsnd666@gmail.com', 13, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (82, '978-7-5598-4846-2', '令人印象深刻的作品，故事讲述得非常精彩。', 9, '小丑', '851314610@qq.com', 13, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (83, '978-7-5598-4846-2', '书的部分内容有些重复，但总的来说是本好书。', 7, '汐渐', 'hyg3146624068@163.com', 13, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (84, '978-7-5598-4846-3', '这是一本充满智慧和知识的书，非常推荐。', 9, 'yhempr', 'yhempr@gmail.com', 14, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (85, '978-7-5598-4846-3', '尽管书中有很多高潮，但有时候显得有些散乱。', 7, '马英九', '2323223@qq.com', 14, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (86, '978-7-5598-4846-3', '作者展现了非凡的叙述技巧，值得一读。', 9, '马英华', '2031282938@qq.com', 14, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (87, '978-7-5598-4846-3', '个别部分略显平庸，但整体上是本不错的书。', 7, 'jocker', 'myhsnd666@gmail.com', 14, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (88, '978-7-5598-4846-5', '书中的故事讲述引人入胜，情节丰富。', 8, '小丑', '851314610@qq.com', 15, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (89, '978-7-5598-4846-5', '尽管整体不错，但部分内容似乎过于简单。', 7, '汐渐', 'hyg3146624068@163.com', 15, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (90, '978-7-5598-4846-5', '作者的想象力真是无与伦比，书写精彩。', 9, 'yhempr', 'yhempr@gmail.com', 15, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (91, '978-7-5598-4846-5', '某些部分略显单薄，但总体来说是部好作品。', 7, '马英九', '2323223@qq.com', 15, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (92, '978-7-5598-4846-6', '这本书的创意和深度令人印象深刻。', 8, '马英华', '2031282938@qq.com', 16, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (93, '978-7-5598-4846-6', '书中有些地方处理得不够好，感觉有些牵强。', 6, 'jocker', 'myhsnd666@gmail.com', 16, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (94, '978-7-5598-4846-6', '非常值得一读，作者展现了高超的写作技巧。', 10, '小丑', '851314610@qq.com', 16, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (95, '978-7-5598-4846-6', '虽有亮点，但整体上缺乏连贯性和深度。', 7, '汐渐', 'hyg3146624068@163.com', 16, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (96, '978-7-5598-4846-7', '书籍内容充满创意，但某些部分过于复杂。', 8, 'yhempr', 'yhempr@gmail.com', 17, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (97, '978-7-5598-4846-7', '故事情节吸引人，但结尾显得有些仓促。', 6, '马英九', '2323223@qq.com', 17, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (98, '978-7-5598-4846-7', '这是一部令人思考的书，非常值得推荐。', 9, '马英华', '2031282938@qq.com', 17, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (99, '978-7-5598-4846-7', '尽管书籍有教育意义，但在某些方面略显平淡。', 7, 'jocker', 'myhsnd666@gmail.com', 17, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (100, '978-7-5598-4846-8', '作者的叙述方式独树一帜，引人入胜。', 9, '小丑', '851314610@qq.com', 18, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (101, '978-7-5598-4846-8', '书中某些部分稍显乏味，缺乏新颖性。', 7, '汐渐', 'hyg3146624068@163.com', 18, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (102, '978-7-5598-4846-8', '内容丰富，给读者带来了深刻的洞察。', 9, 'yhempr', 'yhempr@gmail.com', 18, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (103, '978-7-5598-4846-8', '个别章节需要更多深度，整体上还不错。', 7, '马英九', '2323223@qq.com', 18, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (104, '978-7-5598-4846-1', '书中的观点独到，但表达方式有待提高。', 8, '马英华', '2031282938@qq.com', 19, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (105, '978-7-5598-4846-1', '整体上是本不错的书，但有些地方过于啰嗦。', 6, 'jocker', 'myhsnd666@gmail.com', 19, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (106, '978-7-\r\n\r\n5598-4846-1', '作者的写作风格引人入胜，内容充满深度。', 9, '小丑', '851314610@qq.com', 19, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (107, '978-7-5598-4846-1', '某些部分略显单调，但总的来说还是值得一读。', 8, '汐渐', 'hyg3146624068@163.com', 19, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (108, '978-7-5598-4846-2', '这本书充满了智慧，令人深思。', 9, 'yhempr', 'yhempr@gmail.com', 20, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (109, '978-7-5598-4846-2', '尽管主题有趣，但内容执行力不足。', 6, '马英九', '2323223@qq.com', 20, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (110, '978-7-5598-4846-2', '作者成功地将复杂的主题变得易于理解。', 10, '马英华', '2031282938@qq.com', 20, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (111, '978-7-5598-4846-2', '书中部分论述缺乏充分的证据支持。', 7, 'jocker', 'myhsnd666@gmail.com', 20, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (112, '978-7-5598-4846-3', '非常引人入胜的书籍，讲述了一个吸引人的故事。', 8, 'yhempr', 'yhempr@gmail.com', 21, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (113, '978-7-5598-4846-3', '虽然书中有些章节略显乏味，但总体上还是值得一读。', 7, '马英九', '2323223@qq.com', 21, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (114, '978-7-5598-4846-3', '作者的写作技巧非常出色，创造了一个引人入胜的世界。', 9, '马英华', '2031282938@qq.com', 21, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (115, '978-7-5598-4846-3', '尽管故事情节有创新之处，但有些地方处理不够细致。', 7, 'jocker', 'myhsnd666@gmail.com', 21, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (116, '978-7-5598-4846-4', '一部思想深刻的作品，值得每个人细细品味。', 8, '小丑', '851314610@qq.com', 22, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (117, '978-7-5598-4846-4', '书中某些论点需要更多的论据支持。', 7, '汐渐', 'hyg3146624068@163.com', 22, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (118, '978-7-5598-4846-4', '这本书不仅仅是一部作品，更是一次心灵的旅行。', 10, 'yhempr', 'yhempr@gmail.com', 22, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (119, '978-7-5598-4846-4', '个别章节似乎过于简单，缺乏深度。', 7, '马英九', '2323223@qq.com', 22, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (120, '978-7-5598-4846-5', '作者的叙述手法独特，故事充满张力。', 9, '马英华', '2031282938@qq.com', 23, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (121, '978-7-5598-4846-5', '尽管主题吸引人，但结构上显得有些混乱。', 6, 'jocker', 'myhsnd666@gmail.com', 23, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (122, '978-7-5598-4846-5', '这本书是对该领域的一次深刻探讨，非常值得一读。', 9, '小丑', '851314610@qq.com', 23, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (123, '978-7-5598-4846-5', '一些论述缺乏必要的深度，令人期待更多。', 8, '汐渐', 'hyg3146624068@163.com', 23, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (124, '978-7-5598-4846-6', '书中的深度和见解让人印象深刻。', 8, 'yhempr', 'yhempr@gmail.com', 24, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (125, '978-7-5598-4846-6', '有些部分显得有些重复和拖沓。', 7, '马英九', '2323223@qq.com', 24, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (126, '978-7-5598-4846-6', '作者成功地将复杂的概念简化，易于理解。', 9, '马英华', '2031282938@qq.com', 24, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (127, '978-7-5598-4846-6', '虽有亮点，但整体上缺乏创新性。', 8, 'jocker', 'myhsnd666@gmail.com', 24, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (128, '978-7-5598-4846-7', '这本书是对主题的一次深刻阐述。', 8, '小丑', '851314610@qq.com', 25, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (129, '978-7-5598-4846-7', '部分章节处理略显粗糙，需要更细致的工作。', 7, '汐渐', 'hyg3146624068@163.com', 25, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (130, '978-7-5598-4846-7', '作者展现了深厚的知识和独特的视角。', 10, 'yhempr', 'yhempr@gmail.com', 25, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (131, '978-7-5598-4846-7', '某些内容似乎与主题不太吻合，\r\n\r\n略显突兀。', 7, '马英九', '2323223@qq.com', 25, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (132, '978-7-5598-4846-8', '这本书的创造力和想象力非常出色。', 9, '马英华', '2031282938@qq.com', 26, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (133, '978-7-5598-4846-8', '尽管有些地方显得平淡，但总体上是本不错的书。', 7, 'jocker', 'myhsnd666@gmail.com', 26, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (134, '978-7-5598-4846-8', '作者的表达方式新颖，给读者带来了新鲜感。', 10, '小丑', '851314610@qq.com', 26, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (135, '978-7-5598-4846-8', '有些论点需要更深入的探讨和分析。', 7, '汐渐', 'hyg3146624068@163.com', 26, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (136, '978-7-5598-4846-9', '书中充满了独到的见解和深刻的思考。', 9, 'yhempr', 'yhempr@gmail.com', 27, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (137, '978-7-5598-4846-9', '虽然主题有意义，但执行上略显不足。', 7, '马英九', '2323223@qq.com', 27, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (138, '978-7-5598-4846-9', '作者成功地将复杂的主题呈现得既深刻又易懂。', 10, '马英华', '2031282938@qq.com', 27, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (139, '978-7-5598-4846-9', '书的某些部分对主题的探讨不够深入。', 7, 'jocker', 'myhsnd666@gmail.com', 27, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (140, '978-7-5598-4846-10', '这是一本充满洞见和智慧的作品。', 9, '小丑', '851314610@qq.com', 28, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (141, '978-7-5598-4846-10', '尽管有些章节感觉有些重复，但整体质量很高。', 7, '汐渐', 'hyg3146624068@163.com', 28, '2024-01-10 15:15:39', '2024-01-10 15:15:39');
INSERT INTO `commentforbook` VALUES (150, '978-7-5598-4846-5', '别问，问就是满分', 10, '汐渐', 'hyg3146624068@163.com', 15, '2024-01-14 22:27:39', NULL);
INSERT INTO `commentforbook` VALUES (151, '978-7-5555-4848-8', '伟大的教员同志', 10, '汐渐', 'hyg3146624068@163.com', 1, '2024-01-14 23:53:16', '2024-01-14 23:53:16');

SET FOREIGN_KEY_CHECKS = 1;
